driver-tests/sqlse/derby/selectparambpelJbi/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema" xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <CUSTOMER xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
    <ns0:ZIP xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">33055</ns0:ZIP>
    <ns0:NAME xmlns:ns0="http://j2ee.netbeans.org/xsd/tableSchema">Livermore Enterprises</ns0:NAME>
  </CUSTOMER>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
